{
    "nodes": {
        "start": {
            "option": "Speak to the Lizardman",
            "name": "Rangu",
            "text": "Howdy. Not often I see another traveler out here. Thought you might be another one of theirs at first. Name's Rangu, the Drifting Fang. Been tracking this bandit lot for a while now. They hit the import caravan hard-same way they've hit plenty before. Not just common raiders either. They're tied to the :BLUEVIOLET:Black-Pyre Crime Syndicate:BLUEVIOLET:.",
            "children": [
                ["Who are you?", "rangu_identity"],
                ["The Black-Pyre Syndicate?", "rangu_blackpyre"],
                ["What do we do now?", "rangu_next_step"]
            ]
        },
        "rangu_identity": {
            "name": "Rangu",
            "text": "Just a hunter, mostly. I track beasts, bandits, and anything else that leaves a trail. Spent years following the movement of the Black-Pyre. They're a plague, carving paths through the land with bloodshed. I've had my share of run-ins with them. Too many, maybe.",
            "children": [
                ["The Black-Pyre Syndicate?", "rangu_blackpyre"],
                ["What do we do now?", "rangu_next_step"]
            ],
            "unless": "knows_who_rangu_is",
            "function": "set_knows_who_rangu_is"
        },
        "rangu_blackpyre": {
            "name": "Rangu",
            "text": "The Black-Pyre Syndicate runs smuggling routes and protection rackets. Slaves, stolen goods, weapons. You name it, they move it. They burn their mark into those who cross them. You might see it on some of the ones we hunt. A brand like curling embers on flesh. This raiding party was just a splinter of the whole, but still dangerous.",
            "children": [
                ["What do we do now?", "rangu_next_step"],
                ["Who are you?", "rangu_identity"]
            ],
            "unless": "knows_the_black_pyre",
            "function": "set_knows_the_black_pyre"
        },
        "rangu_next_step": {
            "name": "Rangu",
            "text": "I tracked them to a small camp not far from here. Could strike at them now, but after a raid, they'll be on edge. Not the smartest move. Better to wait, learn what we can. If you're up for it, let's head back to The Lifeblood Tavern. Get a drink, trade what we know. The bigger hideout they stage from is still out there-finding it will take time.",
            "children": [
                ["Alright, let's go.", "fin"],
                ["I'll meet you there later.", "fin"]
            ]
        },
        "fin": {
            "name": "System",
            "text": "None",
            "children": [],
            "function": "finish_rangu_initial"
        }
    }
}
